benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-run3.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.458ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  670.91us   4.97ms   67.46%
    Req/Sec    35.85k     2.10k   43.33k    67.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.34ms
 75.000%    1.85ms
 90.000%    2.45ms
 99.000%    3.18ms
 99.900%    3.64ms
 99.990%    4.32ms
 99.999%    4.68ms
100.000%    4.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            1         1.00
       0.665     0.100000        67252         1.11
       0.871     0.200000       134268         1.25
       1.032     0.300000       201122         1.43
       1.188     0.400000       268179         1.67
       1.344     0.500000       335528         2.00
       1.424     0.550000       369019         2.22
       1.510     0.600000       402291         2.50
       1.604     0.650000       435807         2.86
       1.714     0.700000       469281         3.33
       1.850     0.750000       503005         4.00
       1.933     0.775000       519627         4.44
       2.025     0.800000       536399         5.00
       2.121     0.825000       553186         5.71
       2.223     0.850000       570105         6.67
       2.329     0.875000       586666         8.00
       2.389     0.887500       595156         8.89
       2.449     0.900000       603621        10.00
       2.511     0.912500       611967        11.43
       2.579     0.925000       620332        13.33
       2.655     0.937500       628666        16.00
       2.695     0.943750       632773        17.78
       2.739     0.950000       636950        20.00
       2.787     0.956250       641171        22.86
       2.839     0.962500       645340        26.67
       2.897     0.968750       649472        32.00
       2.931     0.971875       651581        35.56
       2.967     0.975000       653692        40.00
       3.007     0.978125       655779        45.71
       3.049     0.981250       657861        53.33
       3.091     0.984375       659911        64.00
       3.115     0.985938       660988        71.11
       3.137     0.987500       662002        80.00
       3.161     0.989062       663062        91.43
       3.187     0.990625       664104       106.67
       3.213     0.992188       665170       128.00
       3.227     0.992969       665734       142.22
       3.241     0.993750       666241       160.00
       3.257     0.994531       666775       182.86
       3.275     0.995313       667279       213.33
       3.297     0.996094       667795       256.00
       3.309     0.996484       668044       284.44
       3.323     0.996875       668307       320.00
       3.343     0.997266       668561       365.71
       3.367     0.997656       668810       426.67
       3.401     0.998047       669074       512.00
       3.433     0.998242       669201       568.89
       3.475     0.998437       669334       640.00
       3.529     0.998633       669464       731.43
       3.587     0.998828       669595       853.33
       3.643     0.999023       669726      1024.00
       3.681     0.999121       669792      1137.78
       3.721     0.999219       669857      1280.00
       3.759     0.999316       669925      1462.86
       3.799     0.999414       669989      1706.67
       3.865     0.999512       670053      2048.00
       3.903     0.999561       670089      2275.56
       3.941     0.999609       670119      2560.00
       3.995     0.999658       670150      2925.71
       4.043     0.999707       670183      3413.33
       4.111     0.999756       670218      4096.00
       4.135     0.999780       670232      4551.11
       4.167     0.999805       670251      5120.00
       4.211     0.999829       670266      5851.43
       4.239     0.999854       670282      6826.67
       4.287     0.999878       670299      8192.00
       4.315     0.999890       670308      9102.22
       4.327     0.999902       670316     10240.00
       4.339     0.999915       670326     11702.86
       4.367     0.999927       670330     13653.33
       4.391     0.999939       670340     16384.00
       4.399     0.999945       670343     18204.44
       4.419     0.999951       670347     20480.00
       4.427     0.999957       670351     23405.71
       4.467     0.999963       670355     27306.67
       4.515     0.999969       670359     32768.00
       4.563     0.999973       670361     36408.89
       4.591     0.999976       670363     40960.00
       4.603     0.999979       670365     46811.43
       4.619     0.999982       670367     54613.33
       4.639     0.999985       670369     65536.00
       4.643     0.999986       670370     72817.78
       4.663     0.999988       670371     81920.00
       4.679     0.999989       670372     93622.86
       4.719     0.999991       670373    109226.67
       4.727     0.999992       670374    131072.00
       4.815     0.999993       670375    145635.56
       4.815     0.999994       670375    163840.00
       4.831     0.999995       670376    187245.71
       4.831     0.999995       670376    218453.33
       4.839     0.999996       670377    262144.00
       4.839     0.999997       670377    291271.11
       4.839     0.999997       670377    327680.00
       4.859     0.999997       670378    374491.43
       4.859     0.999998       670378    436906.67
       4.859     0.999998       670378    524288.00
       4.859     0.999998       670378    582542.22
       4.859     0.999998       670378    655360.00
       4.971     0.999999       670379    748982.86
       4.971     1.000000       670379          inf
#[Mean    =        1.451, StdDeviation   =        0.671]
#[Max     =        4.968, Total count    =       670379]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  987816 requests in 30.00s, 122.47MB read
Requests/sec:  32927.15
Transfer/sec:      4.08MB