benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-run4.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.453ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  670.71us   5.28ms   67.41%
    Req/Sec    35.85k     2.10k   43.78k    67.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.86ms
 90.000%    2.44ms
 99.000%    3.19ms
 99.900%    3.88ms
 99.990%    4.37ms
 99.999%    4.62ms
100.000%    5.28ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.666     0.100000        67103         1.11
       0.872     0.200000       134450         1.25
       1.033     0.300000       201325         1.43
       1.192     0.400000       268414         1.67
       1.350     0.500000       335433         2.00
       1.431     0.550000       368911         2.22
       1.518     0.600000       402411         2.50
       1.614     0.650000       436003         2.86
       1.724     0.700000       469557         3.33
       1.856     0.750000       503028         4.00
       1.937     0.775000       519701         4.44
       2.027     0.800000       536426         5.00
       2.125     0.825000       553446         5.71
       2.223     0.850000       570088         6.67
       2.327     0.875000       586864         8.00
       2.381     0.887500       595112         8.89
       2.437     0.900000       603540        10.00
       2.497     0.912500       612007        11.43
       2.561     0.925000       620227        13.33
       2.633     0.937500       628683        16.00
       2.673     0.943750       632921        17.78
       2.715     0.950000       637064        20.00
       2.761     0.956250       641207        22.86
       2.813     0.962500       645411        26.67
       2.873     0.968750       649478        32.00
       2.907     0.971875       651596        35.56
       2.945     0.975000       653726        40.00
       2.989     0.978125       655804        45.71
       3.037     0.981250       657874        53.33
       3.089     0.984375       659957        64.00
       3.117     0.985938       661070        71.11
       3.145     0.987500       662085        80.00
       3.173     0.989062       663150        91.43
       3.203     0.990625       664205       106.67
       3.235     0.992188       665255       128.00
       3.251     0.992969       665757       142.22
       3.271     0.993750       666268       160.00
       3.293     0.994531       666782       182.86
       3.323     0.995313       667298       213.33
       3.369     0.996094       667816       256.00
       3.407     0.996484       668083       284.44
       3.453     0.996875       668336       320.00
       3.515     0.997266       668599       365.71
       3.591     0.997656       668856       426.67
       3.671     0.998047       669118       512.00
       3.709     0.998242       669249       568.89
       3.755     0.998437       669381       640.00
       3.801     0.998633       669515       731.43
       3.843     0.998828       669647       853.33
       3.891     0.999023       669777      1024.00
       3.919     0.999121       669846      1137.78
       3.941     0.999219       669907      1280.00
       3.979     0.999316       669969      1462.86
       4.029     0.999414       670035      1706.67
       4.087     0.999512       670100      2048.00
       4.115     0.999561       670133      2275.56
       4.163     0.999609       670172      2560.00
       4.195     0.999658       670202      2925.71
       4.219     0.999707       670235      3413.33
       4.247     0.999756       670266      4096.00
       4.263     0.999780       670283      4551.11
       4.283     0.999805       670298      5120.00
       4.307     0.999829       670318      5851.43
       4.323     0.999854       670333      6826.67
       4.343     0.999878       670348      8192.00
       4.363     0.999890       670358      9102.22
       4.371     0.999902       670364     10240.00
       4.383     0.999915       670372     11702.86
       4.399     0.999927       670379     13653.33
       4.419     0.999939       670387     16384.00
       4.431     0.999945       670394     18204.44
       4.439     0.999951       670395     20480.00
       4.447     0.999957       670400     23405.71
       4.459     0.999963       670403     27306.67
       4.475     0.999969       670407     32768.00
       4.487     0.999973       670410     36408.89
       4.499     0.999976       670411     40960.00
       4.511     0.999979       670413     46811.43
       4.531     0.999982       670416     54613.33
       4.547     0.999985       670417     65536.00
       4.587     0.999986       670418     72817.78
       4.599     0.999988       670419     81920.00
       4.623     0.999989       670421     93622.86
       4.623     0.999991       670421    109226.67
       4.635     0.999992       670422    131072.00
       4.679     0.999993       670424    145635.56
       4.679     0.999994       670424    163840.00
       4.679     0.999995       670424    187245.71
       4.679     0.999995       670424    218453.33
       4.819     0.999996       670425    262144.00
       4.819     0.999997       670425    291271.11
       4.819     0.999997       670425    327680.00
       5.059     0.999997       670426    374491.43
       5.059     0.999998       670426    436906.67
       5.059     0.999998       670426    524288.00
       5.059     0.999998       670426    582542.22
       5.059     0.999998       670426    655360.00
       5.283     0.999999       670427    748982.86
       5.283     1.000000       670427          inf
#[Mean    =        1.454, StdDeviation   =        0.671]
#[Max     =        5.280, Total count    =       670427]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1016576 requests in 30.00s, 126.03MB read
Requests/sec:  33885.83
Transfer/sec:      4.20MB